Revit 2027 API
CompoundStructure.SetLayers Method
 Completely resets this CompoundStructure and applies a new set of layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayers(
	IList<CompoundStructureLayer> layers
)
Public Sub SetLayers (
	layers As IList(Of CompoundStructureLayer)
)
public:
void SetLayers(
	IList<CompoundStructureLayer^>^ layers
)
member SetLayers :
        layers : IList<CompoundStructureLayer> -> unit
Parameters
layers IList<CompoundStructureLayer>
 The layers to be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This function will replace all existing layers with the contents of the input. This provides a full reset for the CompoundStructure. Therefore:
All layers will be marked as Core layers, and any settings related to Shell layers (such as GetFirstCoreLayerIndex(), GetLastCoreLayerIndex() or GetCoreBoundaryLayerIndex(ShellLayerType)) will be modified accordingly.
Because all layers will be set as Core layers, the value of LayerCapFlag will be ignored (and set to true) automatically.
If the layer priority is not set, it will be filled with the default priority by function.
The VariableLayerIndex will be unset.
The StructuralMaterialIndex will be unset.
The compound structure will be set to be vertically homogeneous.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace